wiki/20171112-getopt-of-python-c-bash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>命令行参数处理(c/bash/python)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">命令行参数处理(c/bash/python)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb293e29">1. preface</a></li>
<li><a href="#org07d9867">2. c语言</a>
<ul>
<li><a href="#org6bc3f2b">2.1. 函数参数</a></li>
<li><a href="#org020bf5d">2.2. getopt参数分类</a></li>
<li><a href="#org2e097c8">2.3. 函数处理流程</a></li>
<li><a href="#org10a8301">2.4. 函数返回值</a></li>
<li><a href="#org2ba00e7">2.5. 例子</a></li>
<li><a href="#org95cf4e4">2.6. 长参数处理</a></li>
</ul>
</li>
<li><a href="#orgb1ccea0">3. bash</a></li>
<li><a href="#orged3ee19">4. python语言</a>
<ul>
<li><a href="#org82b397d">4.1. getopt模块</a>
<ul>
<li><a href="#orga6716c3">4.1.1. 这个模块包含两个函数和一个异常：</a></li>
<li><a href="#org8fc6a0a">4.1.2. An example using only Unix style options</a></li>
<li><a href="#orga598459">4.1.3. 同时使用short option和long option</a></li>
</ul>
</li>
<li><a href="#org6c67e03">4.2. argparse模块</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb293e29" class="outline-2">
<h2 id="orgb293e29"><span class="section-number-2">1</span> preface</h2>
<div class="outline-text-2" id="text-1">
<p>
编写命令行工具时，往往需要对命令行参数进行逻辑判断或者提取其中的值。几乎各类语言
都提供了针对性的工具或者函数来处理这个场景。
</p>

<p>
讲解参数处理之前，我们先了解命令行参数进行分类。
按照参数长短来分，命令行参数可分为长参数（&#x2013;color）和短参数（-c）。
按照参数作用区分，有如下三种情况：
</p>
<ul class="org-ul">
<li>不带值的参数。 （比如ls -a）</li>
<li>必须带值的参数。(比如 cut -d : -f 1,7 /etc/passwd)</li>
<li>可选值的参数。</li>
</ul>
</div>
</div>


<div id="outline-container-org07d9867" class="outline-2">
<h2 id="org07d9867"><span class="section-number-2">2</span> c语言<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-2">
<p>
作为系统语言，c语言提供了最为原始的命令行参数处理函数：getopt。（与其说C语言提供，不如说系统提供,通过 man 3 getopt查看man文档）。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #c397d8;">#include</span> <span style="color: #eaeaea;">&lt;</span><span style="color: #70c0b1;">unistd.h</span><span style="color: #eaeaea;">&gt;</span>
<span style="color: #7aa6da;">int</span> <span style="color: #e78c45;">getopt</span><span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">argc</span>, <span style="color: #7aa6da;">char</span> * <span style="color: #b9ca4a;">const</span> <span style="color: #e7c547;">argv</span><span style="color: #70c0b1;">[]</span>,
           <span style="color: #b9ca4a;">const</span> <span style="color: #7aa6da;">char</span> *<span style="color: #e7c547;">optstring</span><span style="color: #eaeaea;">)</span>;
<span style="color: #b9ca4a;">extern</span> <span style="color: #7aa6da;">char</span> *<span style="color: #e7c547;">optarg</span>;
<span style="color: #b9ca4a;">extern</span> <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">optind</span>, <span style="color: #e7c547;">opterr</span>, <span style="color: #e7c547;">optopt</span>;
</pre>
</div>
</div>
<div id="outline-container-org6bc3f2b" class="outline-3">
<h3 id="org6bc3f2b"><span class="section-number-3">2.1</span> 函数参数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
getopt函数用于提取命令行中的参数（且参数必须是短参数）。
</p>
<ul class="org-ul">
<li>参数argc、argv为main函数的两个参数</li>
<li>optstring为用户为该应用程序定义的选项。比如"1abc:d::"。</li>
</ul>
</div>
</div>
<div id="outline-container-org020bf5d" class="outline-3">
<h3 id="org020bf5d"><span class="section-number-3">2.2</span> getopt参数分类</h3>
<div class="outline-text-3" id="text-2-2">
<p>
char*optstring = “ab:c::”;
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
<ul class="org-ul">
<li>单个字符a         表示选项a没有参数            格式：-a即可，不加参数</li>
<li>单字符加冒号b:     表示选项b有且必须加参数      格式：-b 100或-b100,但-b=100错</li>
<li>单字符加2冒号c::   表示选项c可以有，也可以无     格式：-c200，其它格式错误</li>
</ul>
<p>
<code>=====</code>
单个字符a         表示选项a没有参数            格式：-a即可，不加参数
单字符加冒号b:     表示选项b有且必须加参数      格式：-b 100或-b100,但-b=100错
单字符加2冒号c::   表示选项c可以有，也可以无     格式：-c200，其它格式错误
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 078818fc9cb99748da04bde031aa30ad3d784a79
</p>
</div>
</div>
<div id="outline-container-org2e097c8" class="outline-3">
<h3 id="org2e097c8"><span class="section-number-3">2.3</span> 函数处理流程</h3>
<div class="outline-text-3" id="text-2-3">
<p>
注意到有几个全局变量：
</p>
<ul class="org-ul">
<li>optarg (char*)： 指向当前选项参数值（如果有的话）的指针。</li>
<li>optind (int) 再次调用 getopt() 时的下一个 argv指针的索引。</li>
<li>opterr (int): 如果不希望getopt()打印出错信息，则只要将全域变量opterr设为0即可。</li>
<li>optopt (int): 最后一个未知选项。</li>
</ul>

<p>
getopt函数与这几个全局变量配合，完成了参数处理的流程。
getopt随着调用次数的增多，顺次提取argv中的参数，每次只能提取一个参数字符并返回该
字符，并通过全局变量optind保存下一次需要访问argv的位置；如果当前提取的参数是“带
值的参数”，则optarg保存值。
如果要提取argv内所有参数，需要将getopt放到一个while循环内,直到其返回值-1停止。
</p>
</div>
</div>
<div id="outline-container-org10a8301" class="outline-3">
<h3 id="org10a8301"><span class="section-number-3">2.4</span> 函数返回值</h3>
<div class="outline-text-3" id="text-2-4">
<p>
If an option was successfully found, then getopt() returns the option character.
If all command-line options have been parsed, then  getopt() returns  -1.
If  getopt()  encounters an option character that was not in optstring, then '?' is returned.
If getopt() encounters an option with a missing argument, then the return value depends on the first character in optstring: if it is ':', then ':' is returned; otherwise  '?' is returned.
</p>
</div>
</div>
<div id="outline-container-org2ba00e7" class="outline-3">
<h3 id="org2ba00e7"><span class="section-number-3">2.5</span> 例子</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #c397d8;">#include</span> <span style="color: #eaeaea;">&lt;</span><span style="color: #70c0b1;">unistd.h</span><span style="color: #eaeaea;">&gt;</span>
<span style="color: #c397d8;">#include</span> <span style="color: #eaeaea;">&lt;</span><span style="color: #70c0b1;">stdlib.h</span><span style="color: #eaeaea;">&gt;</span>
<span style="color: #c397d8;">#include</span> <span style="color: #eaeaea;">&lt;</span><span style="color: #70c0b1;">stdio.h</span><span style="color: #eaeaea;">&gt;</span>

<span style="color: #7aa6da;">int</span>
<span style="color: #e78c45;">main</span><span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">argc</span>, <span style="color: #7aa6da;">char</span> *<span style="color: #e7c547;">argv</span><span style="color: #70c0b1;">[]</span><span style="color: #eaeaea;">)</span>
<span style="color: #eaeaea;">{</span>
    <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">nsecs</span>=0, <span style="color: #e7c547;">tfnd</span>;
    <span style="color: #7aa6da;">int</span> <span style="color: #e7c547;">flags</span>=0, <span style="color: #e7c547;">opt</span>;

    <span style="color: #b9ca4a;">while</span> <span style="color: #70c0b1;">(</span><span style="color: #e7c547;">(</span>opt = getopt<span style="color: #b9ca4a;">(</span>argc, argv, <span style="color: #70c0b1;">"nt:"</span><span style="color: #b9ca4a;">)</span><span style="color: #e7c547;">)</span> != -1<span style="color: #70c0b1;">)</span> <span style="color: #70c0b1;">{</span>
        <span style="color: #b9ca4a;">switch</span> <span style="color: #e7c547;">(</span>opt<span style="color: #e7c547;">)</span> <span style="color: #e7c547;">{</span>
        <span style="color: #b9ca4a;">case</span> <span style="color: #70c0b1;">'n'</span>:
            flags = 1;
            <span style="color: #b9ca4a;">break</span>;
        <span style="color: #b9ca4a;">case</span> <span style="color: #70c0b1;">'t'</span>:
            nsecs = atoi<span style="color: #b9ca4a;">(</span>optarg<span style="color: #b9ca4a;">)</span>;
            tfnd = 1;
            <span style="color: #b9ca4a;">break</span>;
        <span style="color: #b9ca4a;">default</span>: <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">'?' </span><span style="color: #969896; font-style: italic;">*/</span>
            fprintf<span style="color: #b9ca4a;">(</span>stderr, <span style="color: #70c0b1;">"Usage: %s [-t nsecs] [-n] </span><span style="color: #e7c547;">\</span><span style="color: #c397d8;">n</span><span style="color: #70c0b1;">"</span>,
                    argv<span style="color: #7aa6da;">[</span>0<span style="color: #7aa6da;">]</span><span style="color: #b9ca4a;">)</span>;
            exit<span style="color: #b9ca4a;">(</span>EXIT_FAILURE<span style="color: #b9ca4a;">)</span>;
        <span style="color: #e7c547;">}</span>
    <span style="color: #70c0b1;">}</span>
    printf<span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">"flags=%d; tfnd=%d; optind=%d</span><span style="color: #e7c547;">\</span><span style="color: #c397d8;">n</span><span style="color: #70c0b1;">"</span>, flags, tfnd, optind<span style="color: #70c0b1;">)</span>;
    printf<span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">"nsecs= %d</span><span style="color: #e7c547;">\</span><span style="color: #c397d8;">n</span><span style="color: #70c0b1;">"</span>, nsecs<span style="color: #70c0b1;">)</span>;
    exit<span style="color: #70c0b1;">(</span>EXIT_SUCCESS<span style="color: #70c0b1;">)</span>;
<span style="color: #eaeaea;">}</span>
</pre>
</div>
<p>
执行命令，结果如下：
</p>
<div class="org-src-container">
<pre class="src src-bash">pi@raspberrypi:~ $ ./a.out -t 30
<span style="color: #e7c547;">flags</span>=0; <span style="color: #e7c547;">tfnd</span>=1; <span style="color: #e7c547;">optind</span>=3
<span style="color: #e7c547;">nsecs</span>= 30
pi@raspberrypi:~ $ ./a.out -n
<span style="color: #e7c547;">flags</span>=1; <span style="color: #e7c547;">tfnd</span>=0; <span style="color: #e7c547;">optind</span>=2
<span style="color: #e7c547;">nsecs</span>= 0
pi@raspberrypi:~ $ less /tmp/haha.c
pi@raspberrypi:~ $ ./a.out -n -t 45
<span style="color: #e7c547;">flags</span>=1; <span style="color: #e7c547;">tfnd</span>=1; <span style="color: #e7c547;">optind</span>=4
<span style="color: #e7c547;">nsecs</span>= 45
</pre>
</div>
</div>
</div>
<div id="outline-container-org95cf4e4" class="outline-3">
<h3 id="org95cf4e4"><span class="section-number-3">2.6</span> 长参数处理</h3>
<div class="outline-text-3" id="text-2-6">
<p>
getopt只能处理短参数，为了可以处理长参数#include &lt;getopt.h&gt;提供了getopt<sub>long函数</sub>；
具体用法参考man文档。
</p>
</div>
</div>
</div>

<div id="outline-container-orgb1ccea0" class="outline-2">
<h2 id="orgb1ccea0"><span class="section-number-2">3</span> bash</h2>
<div class="outline-text-2" id="text-3">
<p>
做运维的人估计最熟悉这种情况了。bash存在两种方式进行命令行参数处理：
</p>
<ol class="org-ol">
<li>getopts：这是bash内置的关键字，只能用来出来短参数，用起来跟c语言getopt有些类似。</li>
<li>getopt：这是bash中的一个单独的可执行文件，支持长、短参数。</li>
</ol>
<p>
具体用法不在赘述，参考网友写的几篇文章：
</p>
<ol class="org-ol">
<li><a href="http://www.cnblogs.com/FrankTan/archive/2010/03/01/1634516.html">Bash Shell中命令行选项/参数处理</a></li>
<li><a href="http://blog.csdn.net/MonroeD/article/details/50516515">Bash shell编程&lt;七&gt;：处理选项、getopt命令</a></li>
</ol>
</div>
</div>

<div id="outline-container-orged3ee19" class="outline-2">
<h2 id="orged3ee19"><span class="section-number-2">4</span> python语言</h2>
<div class="outline-text-2" id="text-4">
<p>
python提供了两个模块用于命令行选项处理：一个是传统的getopt模块，一个是自python2.7
引入的argparse模块。前者用起来跟C语言相似，但是后者用起来更加直观、写的代码更少。
注：python2.7之前有个optparse模块已被废弃。
</p>
</div>

<div id="outline-container-org82b397d" class="outline-3">
<h3 id="org82b397d"><span class="section-number-3">4.1</span> getopt模块<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-4-1">
<p>
这个模块提供了分析sys.argv中命令行参数的能力；其作用与系统getopt作用完全一致。
</p>
</div>

<div id="outline-container-orga6716c3" class="outline-4">
<h4 id="orga6716c3"><span class="section-number-4">4.1.1</span> 这个模块包含两个函数和一个异常：</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-python">1. getopt.getopt<span style="color: #eaeaea;">(</span>args, shortopts<span style="color: #70c0b1;">[</span>, longopts=<span style="color: #e7c547;">[]</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
- &#31532;&#19968;&#20010;&#21442;&#25968;args&#25351;&#30340;&#26159;&#35201;&#20998;&#26512;&#30340;&#21629;&#20196;&#34892;&#21442;&#25968;&#21015;&#34920;&#65307;&#36890;&#24120;&#20026; sys.argv<span style="color: #eaeaea;">[</span>1:<span style="color: #eaeaea;">]</span>&#12290;
- &#31532;&#20108;&#20010;&#21442;&#25968;&#20026;&#35201;&#20998;&#26512;&#30340;&#8220;&#30701;&#36873;&#39033;&#8221;&#26684;&#24335;&#23450;&#20041;&#65307;&#27604;&#22914;&#8220;abc:d:&#8221;&#12290; &#20854;&#26684;&#24335;&#23450;&#20041;&#19982;C&#35821;&#35328;&#20013;&#30340;&#30701;&#36873;&#39033;&#26684;&#24335;&#19968;&#33268;&#12290;
- &#31532;&#19977;&#20010;&#21442;&#25968;&#20026;&#21487;&#36873;&#21442;&#25968;&#65292;&#20195;&#34920;&#35201;&#20998;&#26512;&#30340;&#8220;&#38271;&#36873;&#39033;&#8221;&#26684;&#24335;&#23450;&#20041;&#65307;&#20854;&#26684;&#24335;&#26159;&#23383;&#31526;&#20018;&#32452;&#25104;&#30340;&#21015;&#34920;<span style="color: #eaeaea;">&#65288;</span>&#22914;&#26524;&#19968;&#20010;&#36873;&#39033;&#21547;&#26377;&#21442;&#25968;&#65292;&#21017;&#35813;&#36873;&#39033;&#23383;&#31526;&#20018;&#20197;=&#32467;&#26463;&#12290;<span style="color: #eaeaea;">&#65289;</span>
- &#36820;&#22238;&#20540;&#65306;&#35813;&#20989;&#25968;&#36820;&#22238;&#20004;&#20010;&#20803;&#32032;&#12290;&#31532;&#19968;&#20010;&#20803;&#32032;&#20026;<span style="color: #eaeaea;">&#65288;</span>option, value<span style="color: #eaeaea;">&#65289;</span>&#32452;&#25104;&#30340;list&#65292;&#31532;&#20108;&#20010;&#20803;&#32032;&#20026;&#21435;&#38500;&#20989;&#25968;option&#20043;&#21518;&#21097;&#19979;&#30340;&#21629;&#20196;&#34892;&#21442;&#25968;&#12290;
2. getopt.gnu_getopt<span style="color: #eaeaea;">(</span>args, shortopts<span style="color: #70c0b1;">[</span>, longopts=<span style="color: #e7c547;">[]</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
- &#36319;getopt.getopt&#20316;&#29992;&#23436;&#20840;&#19968;&#33268;&#65307;&#21807;&#19968;&#21306;&#21035;&#22312;&#20110;&#20351;&#29992;gun style&#35299;&#20915;&#21629;&#20196;&#34892;&#21442;&#25968;<span style="color: #eaeaea;">(</span>option <span style="color: #b9ca4a;">and</span> non-option arguments may be intermixed. <span style="color: #eaeaea;">)</span>&#12290;
3. exception getopt.GetoptError
- &#24403;&#19968;&#20010;&#26410;&#35782;&#21035;&#30340;option&#34987;&#21457;&#29616;&#65292;&#25110;&#32773;&#19968;&#20010;&#38656;&#35201;argument&#30340;option&#27809;&#26377;&#25552;&#20379;argument&#26102;&#65292;&#20250;&#20135;&#29983;&#35813;&#24322;&#24120;&#12290;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8fc6a0a" class="outline-4">
<h4 id="org8fc6a0a"><span class="section-number-4">4.1.2</span> An example using only Unix style options</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #b9ca4a;">import</span> getopt
&gt;&gt;&gt; <span style="color: #e7c547;">args</span> = <span style="color: #70c0b1;">'-a -b -cfoo -d bar a1 a2'</span>.split<span style="color: #eaeaea;">()</span>
&gt;&gt;&gt; args
<span style="color: #eaeaea;">[</span><span style="color: #70c0b1;">'-a'</span>, <span style="color: #70c0b1;">'-b'</span>, <span style="color: #70c0b1;">'-cfoo'</span>, <span style="color: #70c0b1;">'-d'</span>, <span style="color: #70c0b1;">'bar'</span>, <span style="color: #70c0b1;">'a1'</span>, <span style="color: #70c0b1;">'a2'</span><span style="color: #eaeaea;">]</span>
&gt;&gt;&gt; <span style="color: #e7c547;">optlist</span>, <span style="color: #e7c547;">args</span> = getopt.getopt<span style="color: #eaeaea;">(</span>args, <span style="color: #70c0b1;">'abc:d:'</span><span style="color: #eaeaea;">)</span>
&gt;&gt;&gt; optlist
<span style="color: #eaeaea;">[</span><span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'-a'</span>, <span style="color: #70c0b1;">''</span><span style="color: #70c0b1;">)</span>, <span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'-b'</span>, <span style="color: #70c0b1;">''</span><span style="color: #70c0b1;">)</span>, <span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'-c'</span>, <span style="color: #70c0b1;">'foo'</span><span style="color: #70c0b1;">)</span>, <span style="color: #70c0b1;">(</span><span style="color: #70c0b1;">'-d'</span>, <span style="color: #70c0b1;">'bar'</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">]</span>
&gt;&gt;&gt; args
<span style="color: #eaeaea;">[</span><span style="color: #70c0b1;">'a1'</span>, <span style="color: #70c0b1;">'a2'</span><span style="color: #eaeaea;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga598459" class="outline-4">
<h4 id="orga598459"><span class="section-number-4">4.1.3</span> 同时使用short option和long option</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">import</span> getopt, sys

<span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">main</span><span style="color: #eaeaea;">()</span>:
    <span style="color: #b9ca4a;">try</span>:
        <span style="color: #e7c547;">opts</span>, <span style="color: #e7c547;">args</span> = getopt.getopt<span style="color: #eaeaea;">(</span>sys.argv<span style="color: #70c0b1;">[</span>1:<span style="color: #70c0b1;">]</span>, <span style="color: #70c0b1;">"ho:v"</span>, <span style="color: #70c0b1;">[</span><span style="color: #70c0b1;">"help"</span>, <span style="color: #70c0b1;">"output="</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
    <span style="color: #b9ca4a;">except</span> getopt.GetoptError <span style="color: #b9ca4a;">as</span> err:
        <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">print help information and exit:</span>
        <span style="color: #b9ca4a;">print</span><span style="color: #eaeaea;">(</span>err<span style="color: #eaeaea;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">will print something like "option -a not recognized"</span>
        usage<span style="color: #eaeaea;">()</span>
        sys.<span style="color: #7aa6da;">exit</span><span style="color: #eaeaea;">(</span>2<span style="color: #eaeaea;">)</span>
    <span style="color: #e7c547;">output</span> = <span style="color: #7aa6da;">None</span>
    <span style="color: #e7c547;">verbose</span> = <span style="color: #7aa6da;">False</span>
    <span style="color: #b9ca4a;">for</span> o, a <span style="color: #b9ca4a;">in</span> opts:
        <span style="color: #b9ca4a;">if</span> o == <span style="color: #70c0b1;">"-v"</span>:
            <span style="color: #e7c547;">verbose</span> = <span style="color: #7aa6da;">True</span>
        <span style="color: #b9ca4a;">elif</span> o <span style="color: #b9ca4a;">in</span> <span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"-h"</span>, <span style="color: #70c0b1;">"--help"</span><span style="color: #eaeaea;">)</span>:
            usage<span style="color: #eaeaea;">()</span>
            sys.<span style="color: #7aa6da;">exit</span><span style="color: #eaeaea;">()</span>
        <span style="color: #b9ca4a;">elif</span> o <span style="color: #b9ca4a;">in</span> <span style="color: #eaeaea;">(</span><span style="color: #70c0b1;">"-o"</span>, <span style="color: #70c0b1;">"--output"</span><span style="color: #eaeaea;">)</span>:
            <span style="color: #e7c547;">output</span> = a
        <span style="color: #b9ca4a;">else</span>:
            <span style="color: #b9ca4a;">assert</span> <span style="color: #7aa6da;">False</span>, <span style="color: #70c0b1;">"unhandled option"</span>
    <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">...</span>

<span style="color: #b9ca4a;">if</span> <span style="color: #c397d8;">__name__</span> == <span style="color: #70c0b1;">"__main__"</span>:
    main<span style="color: #eaeaea;">()</span>
</pre>
</div>
<p>
注：
</p>
<ul class="org-ul">
<li>短选项-h与长选项&#x2013;help对应，并且无参数。</li>
<li>短选项-o与长选项&#x2013;output对应，并且有参数。</li>
<li>短选项-v单独是一个选项。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6c67e03" class="outline-3">
<h3 id="org6c67e03"><span class="section-number-3">4.2</span> argparse模块<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h3>
<div class="outline-text-3" id="text-4-2">
<p>
The argparse module makes it easy to write user-friendly command-line interfaces.
The program defines what arguments it requires, and argparse will figure out how to parse those out of sys.argv.
The argparse module also automatically generates help and usage messages and issues errors when users give the program invalid arguments.
</p>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
这个模块相比于传统的getopt体系更加friendly，使用方法参考官方文档。
</p>

<p>
<code>=====</code>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 078818fc9cb99748da04bde031aa30ad3d784a79
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.cnblogs.com/chenliyang/p/6633739.html">命令行选项解析函数(C语言)：getopt()和getopt<sub>long</sub>()</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.python.org/3/library/getopt.html">python getopt module</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.python.org/3.6/library/argparse.html">python argparse module</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
